node {
  name: "Const"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 10
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/observation"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 4
        }
      }
    }
  }
}
node {
  name: "deepq/stochastic"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "deepq/update_eps"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "deepq/eps/initial_value"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/eps"
  op: "VariableV2"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "deepq/eps/Assign"
  op: "Assign"
  input: "deepq/eps"
  input: "deepq/eps/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "deepq/eps/read"
  op: "Identity"
  input: "deepq/eps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deepq/eps"
      }
    }
  }
}
node {
  name: "deepq/q_func/fully_connected/kernel/RandomUniform/RandomUniform/shape"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\004\000\000\000@\000\000\000"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/q_func/fully_connected/kernel/RandomUniform/RandomUniform"
  op: "RandomUniform"
  input: "deepq/q_func/fully_connected/kernel/RandomUniform/RandomUniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
}
node {
  name: "deepq/q_func/fully_connected/kernel/RandomUniform/min"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.29704428
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/q_func/fully_connected/kernel/RandomUniform/max"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.29704428
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/q_func/fully_connected/kernel/RandomUniform/Sub"
  op: "Sub"
  input: "deepq/q_func/fully_connected/kernel/RandomUniform/max"
  input: "deepq/q_func/fully_connected/kernel/RandomUniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/q_func/fully_connected/kernel/RandomUniform/Mul"
  op: "Mul"
  input: "deepq/q_func/fully_connected/kernel/RandomUniform/RandomUniform"
  input: "deepq/q_func/fully_connected/kernel/RandomUniform/Sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/q_func/fully_connected/kernel/RandomUniform"
  op: "Add"
  input: "deepq/q_func/fully_connected/kernel/RandomUniform/Mul"
  input: "deepq/q_func/fully_connected/kernel/RandomUniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/q_func/fully_connected/kernel"
  op: "VariableV2"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
        dim {
          size: 64
        }
      }
    }
  }
}
node {
  name: "deepq/q_func/fully_connected/kernel/Assign"
  op: "Assign"
  input: "deepq/q_func/fully_connected/kernel"
  input: "deepq/q_func/fully_connected/kernel/RandomUniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "deepq/q_func/fully_connected/kernel/read"
  op: "Identity"
  input: "deepq/q_func/fully_connected/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deepq/q_func/fully_connected/kernel"
      }
    }
  }
}
node {
  name: "deepq/q_func/fully_connected/bias/initial_value"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/q_func/fully_connected/bias"
  op: "VariableV2"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
}
node {
  name: "deepq/q_func/fully_connected/bias/Assign"
  op: "Assign"
  input: "deepq/q_func/fully_connected/bias"
  input: "deepq/q_func/fully_connected/bias/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "deepq/q_func/fully_connected/bias/read"
  op: "Identity"
  input: "deepq/q_func/fully_connected/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deepq/q_func/fully_connected/bias"
      }
    }
  }
}
node {
  name: "deepq/q_func/fully_connected/MatMul"
  op: "MatMul"
  input: "deepq/observation"
  input: "deepq/q_func/fully_connected/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
}
node {
  name: "deepq/q_func/fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "deepq/q_func/fully_connected/MatMul"
  input: "deepq/q_func/fully_connected/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "deepq/q_func/Relu"
  op: "Relu"
  input: "deepq/q_func/fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/q_func/fully_connected_1/kernel/RandomUniform/RandomUniform/shape"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "@\000\000\000\002\000\000\000"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/q_func/fully_connected_1/kernel/RandomUniform/RandomUniform"
  op: "RandomUniform"
  input: "deepq/q_func/fully_connected_1/kernel/RandomUniform/RandomUniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
}
node {
  name: "deepq/q_func/fully_connected_1/kernel/RandomUniform/min"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.30151135
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/q_func/fully_connected_1/kernel/RandomUniform/max"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.30151135
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/q_func/fully_connected_1/kernel/RandomUniform/Sub"
  op: "Sub"
  input: "deepq/q_func/fully_connected_1/kernel/RandomUniform/max"
  input: "deepq/q_func/fully_connected_1/kernel/RandomUniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/q_func/fully_connected_1/kernel/RandomUniform/Mul"
  op: "Mul"
  input: "deepq/q_func/fully_connected_1/kernel/RandomUniform/RandomUniform"
  input: "deepq/q_func/fully_connected_1/kernel/RandomUniform/Sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/q_func/fully_connected_1/kernel/RandomUniform"
  op: "Add"
  input: "deepq/q_func/fully_connected_1/kernel/RandomUniform/Mul"
  input: "deepq/q_func/fully_connected_1/kernel/RandomUniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/q_func/fully_connected_1/kernel"
  op: "VariableV2"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "deepq/q_func/fully_connected_1/kernel/Assign"
  op: "Assign"
  input: "deepq/q_func/fully_connected_1/kernel"
  input: "deepq/q_func/fully_connected_1/kernel/RandomUniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "deepq/q_func/fully_connected_1/kernel/read"
  op: "Identity"
  input: "deepq/q_func/fully_connected_1/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deepq/q_func/fully_connected_1/kernel"
      }
    }
  }
}
node {
  name: "deepq/q_func/fully_connected_1/bias/initial_value"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 2
          }
        }
        float_val: 0.0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/q_func/fully_connected_1/bias"
  op: "VariableV2"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "deepq/q_func/fully_connected_1/bias/Assign"
  op: "Assign"
  input: "deepq/q_func/fully_connected_1/bias"
  input: "deepq/q_func/fully_connected_1/bias/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "deepq/q_func/fully_connected_1/bias/read"
  op: "Identity"
  input: "deepq/q_func/fully_connected_1/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deepq/q_func/fully_connected_1/bias"
      }
    }
  }
}
node {
  name: "deepq/q_func/fully_connected_1/MatMul"
  op: "MatMul"
  input: "deepq/q_func/Relu"
  input: "deepq/q_func/fully_connected_1/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
}
node {
  name: "deepq/q_func/fully_connected_1/BiasAdd"
  op: "BiasAdd"
  input: "deepq/q_func/fully_connected_1/MatMul"
  input: "deepq/q_func/fully_connected_1/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "deepq/deterministic_actions/dimension"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/deterministic_actions"
  op: "ArgMax"
  input: "deepq/q_func/fully_connected_1/BiasAdd"
  input: "deepq/deterministic_actions/dimension"
  attr {
    key: "output_type"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/Shape"
  op: "Shape"
  input: "deepq/observation"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/strided_slice/stack"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/strided_slice"
  op: "StridedSlice"
  input: "deepq/Shape"
  input: "deepq/strided_slice/stack"
  input: "deepq/strided_slice/stack_1"
  input: "deepq/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "deepq/stack"
  op: "Pack"
  input: "deepq/strided_slice"
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "N"
    value {
      i: 1
    }
  }
}
node {
  name: "deepq/random_actions/min"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/random_actions/max"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/random_actions/RandomUniformInt"
  op: "RandomUniformInt"
  input: "deepq/stack"
  input: "deepq/random_actions/min"
  input: "deepq/random_actions/max"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
  attr {
    key: "Tout"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
}
node {
  name: "deepq/random_actions/Sub"
  op: "Sub"
  input: "deepq/random_actions/max"
  input: "deepq/random_actions/min"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/random_actions/Mul"
  op: "Mul"
  input: "deepq/random_actions/RandomUniformInt"
  input: "deepq/random_actions/Sub"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/random_actions"
  op: "Add"
  input: "deepq/random_actions/Mul"
  input: "deepq/random_actions/min"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/stack_1"
  op: "Pack"
  input: "deepq/strided_slice"
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "N"
    value {
      i: 1
    }
  }
}
node {
  name: "deepq/RandomUniform/min"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/RandomUniform/max"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/RandomUniform/RandomUniform"
  op: "RandomUniform"
  input: "deepq/stack_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
}
node {
  name: "deepq/RandomUniform/Sub"
  op: "Sub"
  input: "deepq/RandomUniform/max"
  input: "deepq/RandomUniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/RandomUniform/Mul"
  op: "Mul"
  input: "deepq/RandomUniform/RandomUniform"
  input: "deepq/RandomUniform/Sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/RandomUniform"
  op: "Add"
  input: "deepq/RandomUniform/Mul"
  input: "deepq/RandomUniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/Less"
  op: "Less"
  input: "deepq/RandomUniform"
  input: "deepq/eps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/stochastic_action"
  op: "Select"
  input: "deepq/Less"
  input: "deepq/random_actions"
  input: "deepq/deterministic_actions"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/Switch"
  op: "Switch"
  input: "deepq/stochastic"
  input: "deepq/stochastic"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "deepq/switch_t"
  op: "Identity"
  input: "deepq/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "deepq/switch_f"
  op: "Identity"
  input: "deepq/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "deepq/pred_id"
  op: "Identity"
  input: "deepq/stochastic"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "deepq/Switch_1"
  op: "Switch"
  input: "deepq/stochastic_action"
  input: "deepq/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deepq/stochastic_action"
      }
    }
  }
}
node {
  name: "deepq/Switch_2"
  op: "Switch"
  input: "deepq/deterministic_actions"
  input: "deepq/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deepq/deterministic_actions"
      }
    }
  }
}
node {
  name: "deepq/Merge"
  op: "Merge"
  input: "deepq/Switch_1:1"
  input: "deepq/Switch_2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "N"
    value {
      i: 2
    }
  }
}
node {
  name: "deepq/Const"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/GreaterEqual"
  op: "GreaterEqual"
  input: "deepq/update_eps"
  input: "deepq/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/Switch_3"
  op: "Switch"
  input: "deepq/GreaterEqual"
  input: "deepq/GreaterEqual"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "deepq/switch_t_1"
  op: "Identity"
  input: "deepq/Switch_3:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "deepq/switch_f_1"
  op: "Identity"
  input: "deepq/Switch_3"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "deepq/pred_id_1"
  op: "Identity"
  input: "deepq/GreaterEqual"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "deepq/Switch_4"
  op: "Switch"
  input: "deepq/update_eps"
  input: "deepq/pred_id_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deepq/update_eps"
      }
    }
  }
}
node {
  name: "deepq/Switch_5"
  op: "RefSwitch"
  input: "deepq/eps"
  input: "deepq/pred_id_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deepq/eps"
      }
    }
  }
}
node {
  name: "deepq/Merge_1"
  op: "Merge"
  input: "deepq/Switch_4:1"
  input: "deepq/Switch_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "N"
    value {
      i: 2
    }
  }
}
node {
  name: "deepq/Assign"
  op: "Assign"
  input: "deepq/eps"
  input: "deepq/Merge_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "deepq_1/obs_t"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 4
        }
      }
    }
  }
}
node {
  name: "deepq_1/action"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "deepq_1/reward"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "deepq_1/obs_tp1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 4
        }
      }
    }
  }
}
node {
  name: "deepq_1/done"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "deepq_1/weight"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "deepq_1/q_func/fully_connected/MatMul"
  op: "MatMul"
  input: "deepq_1/obs_t"
  input: "deepq/q_func/fully_connected/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
}
node {
  name: "deepq_1/q_func/fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "deepq_1/q_func/fully_connected/MatMul"
  input: "deepq/q_func/fully_connected/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "deepq_1/q_func/Relu"
  op: "Relu"
  input: "deepq_1/q_func/fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/q_func/fully_connected_1/MatMul"
  op: "MatMul"
  input: "deepq_1/q_func/Relu"
  input: "deepq/q_func/fully_connected_1/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
}
node {
  name: "deepq_1/q_func/fully_connected_1/BiasAdd"
  op: "BiasAdd"
  input: "deepq_1/q_func/fully_connected_1/MatMul"
  input: "deepq/q_func/fully_connected_1/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected/kernel/RandomUniform/RandomUniform/shape"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\004\000\000\000@\000\000\000"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected/kernel/RandomUniform/RandomUniform"
  op: "RandomUniform"
  input: "deepq/target_q_func/fully_connected/kernel/RandomUniform/RandomUniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected/kernel/RandomUniform/min"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.29704428
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected/kernel/RandomUniform/max"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.29704428
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected/kernel/RandomUniform/Sub"
  op: "Sub"
  input: "deepq/target_q_func/fully_connected/kernel/RandomUniform/max"
  input: "deepq/target_q_func/fully_connected/kernel/RandomUniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected/kernel/RandomUniform/Mul"
  op: "Mul"
  input: "deepq/target_q_func/fully_connected/kernel/RandomUniform/RandomUniform"
  input: "deepq/target_q_func/fully_connected/kernel/RandomUniform/Sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected/kernel/RandomUniform"
  op: "Add"
  input: "deepq/target_q_func/fully_connected/kernel/RandomUniform/Mul"
  input: "deepq/target_q_func/fully_connected/kernel/RandomUniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected/kernel"
  op: "VariableV2"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
        dim {
          size: 64
        }
      }
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected/kernel/Assign"
  op: "Assign"
  input: "deepq/target_q_func/fully_connected/kernel"
  input: "deepq/target_q_func/fully_connected/kernel/RandomUniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected/kernel/read"
  op: "Identity"
  input: "deepq/target_q_func/fully_connected/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deepq/target_q_func/fully_connected/kernel"
      }
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected/bias/initial_value"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected/bias"
  op: "VariableV2"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected/bias/Assign"
  op: "Assign"
  input: "deepq/target_q_func/fully_connected/bias"
  input: "deepq/target_q_func/fully_connected/bias/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected/bias/read"
  op: "Identity"
  input: "deepq/target_q_func/fully_connected/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deepq/target_q_func/fully_connected/bias"
      }
    }
  }
}
node {
  name: "deepq_1/target_q_func/fully_connected/MatMul"
  op: "MatMul"
  input: "deepq_1/obs_tp1"
  input: "deepq/target_q_func/fully_connected/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
}
node {
  name: "deepq_1/target_q_func/fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "deepq_1/target_q_func/fully_connected/MatMul"
  input: "deepq/target_q_func/fully_connected/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "deepq_1/target_q_func/Relu"
  op: "Relu"
  input: "deepq_1/target_q_func/fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected_1/kernel/RandomUniform/RandomUniform/shape"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "@\000\000\000\002\000\000\000"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected_1/kernel/RandomUniform/RandomUniform"
  op: "RandomUniform"
  input: "deepq/target_q_func/fully_connected_1/kernel/RandomUniform/RandomUniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected_1/kernel/RandomUniform/min"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.30151135
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected_1/kernel/RandomUniform/max"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.30151135
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected_1/kernel/RandomUniform/Sub"
  op: "Sub"
  input: "deepq/target_q_func/fully_connected_1/kernel/RandomUniform/max"
  input: "deepq/target_q_func/fully_connected_1/kernel/RandomUniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected_1/kernel/RandomUniform/Mul"
  op: "Mul"
  input: "deepq/target_q_func/fully_connected_1/kernel/RandomUniform/RandomUniform"
  input: "deepq/target_q_func/fully_connected_1/kernel/RandomUniform/Sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected_1/kernel/RandomUniform"
  op: "Add"
  input: "deepq/target_q_func/fully_connected_1/kernel/RandomUniform/Mul"
  input: "deepq/target_q_func/fully_connected_1/kernel/RandomUniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected_1/kernel"
  op: "VariableV2"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected_1/kernel/Assign"
  op: "Assign"
  input: "deepq/target_q_func/fully_connected_1/kernel"
  input: "deepq/target_q_func/fully_connected_1/kernel/RandomUniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected_1/kernel/read"
  op: "Identity"
  input: "deepq/target_q_func/fully_connected_1/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deepq/target_q_func/fully_connected_1/kernel"
      }
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected_1/bias/initial_value"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 2
          }
        }
        float_val: 0.0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected_1/bias"
  op: "VariableV2"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected_1/bias/Assign"
  op: "Assign"
  input: "deepq/target_q_func/fully_connected_1/bias"
  input: "deepq/target_q_func/fully_connected_1/bias/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "deepq/target_q_func/fully_connected_1/bias/read"
  op: "Identity"
  input: "deepq/target_q_func/fully_connected_1/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deepq/target_q_func/fully_connected_1/bias"
      }
    }
  }
}
node {
  name: "deepq_1/target_q_func/fully_connected_1/MatMul"
  op: "MatMul"
  input: "deepq_1/target_q_func/Relu"
  input: "deepq/target_q_func/fully_connected_1/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
}
node {
  name: "deepq_1/target_q_func/fully_connected_1/BiasAdd"
  op: "BiasAdd"
  input: "deepq_1/target_q_func/fully_connected_1/MatMul"
  input: "deepq/target_q_func/fully_connected_1/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "deepq_1/Const"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/Const_1"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Const_2"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/OneHot"
  op: "OneHot"
  input: "deepq_1/action"
  input: "deepq_1/Const"
  input: "deepq_1/Const_1"
  input: "deepq_1/Const_2"
  attr {
    key: "axis"
    value {
      i: -1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "TI"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/Mul"
  op: "Mul"
  input: "deepq_1/q_func/fully_connected_1/BiasAdd"
  input: "deepq_1/OneHot"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Const_3"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/Sum"
  op: "Sum"
  input: "deepq_1/Mul"
  input: "deepq_1/Const_3"
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/q_func_1/fully_connected/MatMul"
  op: "MatMul"
  input: "deepq_1/obs_tp1"
  input: "deepq/q_func/fully_connected/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
}
node {
  name: "deepq_1/q_func_1/fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "deepq_1/q_func_1/fully_connected/MatMul"
  input: "deepq/q_func/fully_connected/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "deepq_1/q_func_1/Relu"
  op: "Relu"
  input: "deepq_1/q_func_1/fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/q_func_1/fully_connected_1/MatMul"
  op: "MatMul"
  input: "deepq_1/q_func_1/Relu"
  input: "deepq/q_func/fully_connected_1/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
}
node {
  name: "deepq_1/q_func_1/fully_connected_1/BiasAdd"
  op: "BiasAdd"
  input: "deepq_1/q_func_1/fully_connected_1/MatMul"
  input: "deepq/q_func/fully_connected_1/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "deepq_1/ArgMax/dimension"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/ArgMax"
  op: "ArgMax"
  input: "deepq_1/q_func_1/fully_connected_1/BiasAdd"
  input: "deepq_1/ArgMax/dimension"
  attr {
    key: "output_type"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/Const_4"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/Const_5"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Const_6"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/OneHot_1"
  op: "OneHot"
  input: "deepq_1/ArgMax"
  input: "deepq_1/Const_4"
  input: "deepq_1/Const_5"
  input: "deepq_1/Const_6"
  attr {
    key: "axis"
    value {
      i: -1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "TI"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/Mul_1"
  op: "Mul"
  input: "deepq_1/target_q_func/fully_connected_1/BiasAdd"
  input: "deepq_1/OneHot_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Const_7"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/Sum_1"
  op: "Sum"
  input: "deepq_1/Mul_1"
  input: "deepq_1/Const_7"
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/Const_8"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Sub"
  op: "Sub"
  input: "deepq_1/Const_8"
  input: "deepq_1/done"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Mul_2"
  op: "Mul"
  input: "deepq_1/Sub"
  input: "deepq_1/Sum_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Const_9"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Mul_3"
  op: "Mul"
  input: "deepq_1/Const_9"
  input: "deepq_1/Mul_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Add"
  op: "Add"
  input: "deepq_1/reward"
  input: "deepq_1/Mul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/StopGradient"
  op: "StopGradient"
  input: "deepq_1/Add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Sub_1"
  op: "Sub"
  input: "deepq_1/Sum"
  input: "deepq_1/StopGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Const_10"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Abs"
  op: "Abs"
  input: "deepq_1/Sub_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Less"
  op: "Less"
  input: "deepq_1/Abs"
  input: "deepq_1/Const_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Square"
  op: "Square"
  input: "deepq_1/Sub_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Const_11"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Mul_4"
  op: "Mul"
  input: "deepq_1/Square"
  input: "deepq_1/Const_11"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Abs_1"
  op: "Abs"
  input: "deepq_1/Sub_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Const_12"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Mul_5"
  op: "Mul"
  input: "deepq_1/Const_12"
  input: "deepq_1/Const_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Sub_2"
  op: "Sub"
  input: "deepq_1/Abs_1"
  input: "deepq_1/Mul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Mul_6"
  op: "Mul"
  input: "deepq_1/Const_10"
  input: "deepq_1/Sub_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Where"
  op: "Select"
  input: "deepq_1/Less"
  input: "deepq_1/Mul_4"
  input: "deepq_1/Mul_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Mul_7"
  op: "Mul"
  input: "deepq_1/weight"
  input: "deepq_1/Where"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Const_13"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/weighted_error"
  op: "Mean"
  input: "deepq_1/Mul_7"
  input: "deepq_1/Const_13"
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/OnesLike"
  op: "OnesLike"
  input: "deepq_1/weighted_error"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deepq_1/Shape"
  op: "Shape"
  input: "deepq_1/Mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/Const_14"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/Const_15"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/Size"
  op: "Size"
  input: "deepq_1/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/Add_1"
  op: "Add"
  input: "deepq_1/Const_13"
  input: "deepq_1/Size"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/Mod"
  op: "Mod"
  input: "deepq_1/Add_1"
  input: "deepq_1/Size"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deepq_1/Range"
  op: "Range"
  input: "deepq_1/Const_14"
  input: "deepq_1/Size"
  input: "deepq_1/Const_15"
  attr {
    key: "Tidx"
